lisir233/ESP-Iris/components/esp_iris/test_apps/system_update/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s31"
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESPTOOLPY_FLASHSIZE_2MB=y
CONFIG_ESP_IRIS_TRANSPORT_TCP=y
CONFIG_ESP_IRIS_SYSTEM_UPDATE=y
CONFIG_ESP_IRIS_SYSTEM_UPDATE_CHUNK_BYTES=1024
CONFIG_ESP_IRIS_SYSTEM_UPDATE_MANIFEST_BYTES=2048
CONFIG_ESP_IRIS_SYSTEM_UPDATE_SIGNATURE_BYTES=256
CONFIG_ESP_IRIS_SYSTEM_UPDATE_MAX_COMPONENTS=4
